Repository: 84000/data-translation-memory
Catalog: Toh_78-The_Questions_of_Gunaratnasankusumita-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །
en: The Noble Great Vehicle Sūtra The Questions of Guṇaratnasaṅkusumita

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་རབ་ཏུ་མང་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing at Vulture Peak Mountain in Rājagṛha together with a great assembly of one thousand two hundred fifty monks and many thousands of bodhisattvas.

source: དེའི་ཚེ་འཁོར་དེ་ཉིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲོང་ཁྱེར་ཡངས་པའི་ལིད་ཙ་བྱི་གཞོན་ནུ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་ཞིག་འདུས་པར་གྱུར་ཏེ་འདུག་གོ །
en: Included in the assembly at that time was a bodhisattva great being, a Licchavi prince from the city of Vaiśālī named Guṇaratnasaṅkusumita.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་སྟན་ལས་ལངས་ཏེ།
en: The bodhisattva great being Guṇaratnasaṅkusumita rose from his seat, draped his upper robe over one shoulder, and

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: knelt with his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With joined palms, he bowed toward the Blessed One and inquired,

source: གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་དབྱེ་བར་གནང་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་ལགས་སོ། །
en: “If the Blessed One would grant me the opportunity to request instruction, I would like to ask a question of the honored, blessed, thus-gone, worthy, perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the bodhisattva great being Guṇaratnasaṅkusumita,

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་ཞུས་ཤིག་དང་། ཞུ་བ་དེ་དང་དེ་ཉིད་ཀྱི་ལུང་བསྟན་པས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: “Guṇaratnasaṅkusumita, do ask the thus-gone, worthy, perfect Buddha whatever you wish. Then I will address your questions and set your mind at ease.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Guṇaratnasaṅkusumita then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ད་ལྟར་ན་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དེ་རྣམས་ཀྱི་མཚན་བཟུང་ན།
en: “Blessed One, are there presently blessed buddhas residing alive and well in other world systems whose names, when remembered,

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལྟ་དག་བཞུགས་ལགས་སམ།
en: cause noble sons and daughters to swiftly and fully awaken to unexcelled and perfect buddhahood?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Very good, Guṇaratnasaṅkusumita,” the Blessed One responded to the bodhisattva great being Guṇaratnasaṅkusumita, “very good!

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཁྱོད་ད་ལྟར་དང་། མ་འོངས་པའི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཞུ་བར་སེམས་པ་ནི་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཁྱོད་ཡང་ལེགས་སོ། །
en: Guṇaratnasaṅkusumita, your motivation for asking this question of the Thus-Gone One is to benefit and bring happiness to many beings now and in the future. You have asked this question out of love for the world and to benefit, help, and bring happiness to bodhisattvas, gods, and humans. Very good, Guṇaratnasaṅkusumita!

source: དེའི་ཕྱིར་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་དོ། །
en: Therefore, Guṇaratnasaṅkusumita, listen well and pay attention. I will explain it to you.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང་།
en: “Blessed One, I shall do that!” said the bodhisattva great being Guṇaratnasaṅkusumita, and he listened as the Blessed One had instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One said,

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཤར་ཕྱོགས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན།
en: “Guṇaratnasaṅkusumita, to the east of here is a world system known as Arrayed with the Qualities of All Phenomena.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་རིན་ཆེན་དཔག་ཏུ་མེད་པ་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལྟ་བུ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There the thus-gone, worthy, perfect Buddha Array of Immense Precious Qualities Like the King of Splendor currently resides, alive and well.

source: བསྐལ་པ་དེ་ནི་རྒྱས་པ་ཐམས་ཅད་ཀུན་ནས་བསྡུས་པ་ཞེས་བྱའོ། །
en: That eon is known as Gathering of Complete Abundance.

source: དེ་ན་སེམས་ཅན་རྣམས་ཀྱི་ཚེ་ནི་དཔག་ཏུ་མེད་དོ། །
en: There, the lifespan of sentient beings is immeasurable.

source: བཅོམ་ལྡན་འདས་དེའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་འཁོར་དཔག་ཏུ་མེད་དོ། །
en: That blessed one’s full retinue of bodhisattvas is also innumerable.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་རིན་ཆེན་དཔག་ཏུ་མེད་པ་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལྟ་བུ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་ནི་བསྐལ་པ་སྟོང་ཕྲག་དྲུག་ཅུའི་འཁོར་བ་སྙིལ་བར་བྱེད་དོ། །
en: When faithful noble sons and daughters remember the name of the blessed, thus-gone, worthy, perfect Buddha Array of Immense Precious Qualities Like the King of Splendor, sixty thousand eons of wandering in cyclic existence are negated.

source: ཚེ་རྗེས་ནས་ཀྱང་སྒྲིབ་པ་མེད་པར་སྟོན་པ་ཞེས་བྱ་བའི་གཟུངས་ཐོབ་པར་འགྱུར་རོ། །
en: “From their next lives onward, they will attain the dhāraṇī called unhindered teaching .

source: !སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུ་རྣམས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སྤོབས་པ་ཉེ་བར་སྒྲུབ་པར་མཛད་དོ། །
en: They will be provided with the eloquence of the blessed buddhas in a hundred million buddhafields.

source: ཆོས་སྟོན་པ་ན་བག་ཚ་བ་ཡང་མེད་པར་འགྱུར་རོ། །
en: When they teach the Dharma, they will have no trepidation.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Regarding this, it is said:

source: མི་གང་སངས་རྒྱས་མཚན་འདི་རྗོད་བྱེད་པ། །དེ་ལ་ཡོན་ཏན་འདི་རྣམས་མྱུར་དུ་འབྱུང་། །
en: “ ‘Those who speak this buddha’s name Will quickly manifest these qualities.

source: དེ་ལ་དེ་བས་ལྷག་པ་གཞན་ཡང་འབྱུང་། །
en: For them, even better things will occur,

source: དེ་ལ་བླ་མེད་བྱང་ཆུབ་དཀའ་མ་ཡིན། །
en: And unsurpassed awakening will not be difficult.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ལྷོ་ཕྱོགས་ན་ཡོན་ཏན་རིན་ཆེན་བཀོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་རིན་ཆེན་དཔལ་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལྟ་བུ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེའཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: “Guṇaratnasaṅkusumita, to the south of here is a world system known as Arrayed with Precious Qualities. There, the thus-gone, worthy, perfect Buddha King of Splendor Arrayed with the Glory of Precious Qualities currently resides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཡོན་ཏན་རྒྱས་པ་ཞེས་བྱའོ། །
en: That eon is known as Flourishing Qualities.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་རིན་ཆེན་དཔལ་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལྟ་བུ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་ནི་ཚེ་རྗེས་མ་ཐག་ཏུ་ཉི་མའི་དཀྱིལ་འཁོར་གྱི་མཐའ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha King of Splendor Arrayed with the Glory of Precious Qualities will, immediately in their next lives, attain the absorption known as the sun disk’s universal illumination .

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་བཀོད་པ་ཡང་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: They will also attain an array of the immeasurable qualities of the buddhafields.

source: ཚེ་རྗེས་མ་ཐག་ཏུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་འཐོབ་པར་འགྱུར་རོ། །
en: Immediately in their next lives they will attain the thirty-two marks of a great being.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དུ་སྨོན་ལམ་འདེབས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་དེར་སྐྱེ་བར་འགྱུར་རོ། །
en: They will be born into the buddhafield of their aspiration prayers.

source: སྐྱེ་བ་གཅིག་གིས་ཐོགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་རོ། །
en: Since for them only a single rebirth remains, they will fully awaken to unexcelled and perfect buddhahood.

source: སྤོབས་པ་རྒྱུན་མི་འཆད་པ་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will also achieve unceasing eloquence.

source: མི་གང་སངས་རྒྱས་མཚན་འདི་རྗོད་བྱེད་པ། །དེ་ལ་ཏིང་འཛིན་བསམ་ཡས་དེ་སྐྱེ་ཞིང་། །
en: “ ‘Those who speak this buddha’s name Will manifest inconceivable absorptions.

source: སུམ་ཅུ་རྩ་གཉིས་མཚན་ལྡན་ལུས་འཐོབ་ལ། །དེ་ནི་བྱང་ཆུབ་སྐྱེ་བ་གཅིག་ཐོགས་འགྱུར། །
en: They will attain bodies endowed with the thirty-two marks, And they will be just one rebirth away from awakening.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ནུབ་ཕྱོགས་ན་མྱ་ངན་དང་མུན་པ་ཐམས་ཅད་དང་བྲལ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ལ་སྤོབས་པ་བཀོད་པའི་དཔལ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེའཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: “Guṇaratnasaṅkusumita, to the west of here is a world system known as Free of All Misery and Darkness. There, the thus-gone, worthy, perfect Buddha Glorious Array of Eloquence in All Teachings currently resides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཤཱཀྱ་མངོན་པར་མཛེས་པ་ཞེས་བྱའོ། །
en: That eon is known as Beautiful Śākya.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ལ་སྤོབས་པ་བཀོད་པའི་དཔལ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་ནི་མཚོན་གྱིས་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha Glorious Array of Eloquence in All Teachings will not meet their deaths because of a blade.

source: དུག་གིས་མ་ཡིན། ཆུས་མ་ཡིན་ཏེ། མེས་ཀྱང་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ། །རྫུས་ཏེ་སྐྱེ་བར་ཡང་འགྱུར་རོ། །
en: Furthermore, they will not meet their deaths because of poison, water, or fire, and they will have a miraculous rebirth.

source: ཚེ་རྗེས་མ་ཐག་ཏུ་ཡང་ཤུགས་བརྒྱ་པ་ཞེས་བྱ་བའི་གཟུངས་འཐོབ་པར་འགྱུར་རོ། །
en: Immediately in their next lives they will attain the dhāraṇī called one hundred powers .

source: མི་གང་སངས་རྒྱས་མཚན་འདི་རྗོད་བྱེད་པ། །འདི་ལ་མི་དེའི་ལུས་མེས་མི་འཆི་ཞིང་། །མཚོན་གྱིས་མིན་ལ་ཆུས་མིན་དུག་གིས་མིན། །
en: “ ‘Those who speak this buddha’s name Will not perish by fire, Or by blade, water, or poison;

source: དེ་ནི་རྫུས་ཏེ་སྐྱེ་བ་ཁོ་ནར་འགྱུར། །
en: They will have only miraculous rebirths.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་བྱང་ཕྱོགས་ན་མུན་པ་དང་རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོབས་པ་དཔག་མེད་བཀོད་པ་ཡང་དག་པར་སྤྱོད་པའི་བློ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེའཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: “Guṇaratnasaṅkusumita, to the north of here is a world system known as Free of Darkness and Gloom. There, the thus-gone, worthy, perfect Buddha Intelligence Arrayed with Immeasurable Eloquence currently resides, alive and well.

source: བསྐལ་པ་དེ་ནི་གྲགས་པ་ཆེན་པོ་འཛིན་པ་ཞེས་བྱའོ། །
en: That eon is known as Holding Great Renown.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོབས་པ་དཔག་མེད་བཀོད་པ་ཡང་དག་པར་སྤྱོད་པའི་བློ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་ནི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་མཉེས་པར་བྱེད་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha Intelligence Arrayed with Immeasurable Eloquence will please tens of billions of buddhas.

source: ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་གཟུངས་ཀྱང་ཐོབ་པར་འགྱུར་རོ། །ཟད་མི་ཤེས་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཀྱང་ཐོབ་པར་འགྱུར་བ་ནས་
en: They will attain the dhāraṇī called following everywhere , as well as the dhāraṇī known as inexhaustible casket , and

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་ཡང་འགྱུར་རོ། །
en: will subsequently fully awaken to unexcelled and perfect buddhahood.

source: ངན་སོང་གསུམ་པོ་རྣམས་སུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: They will not be born into the three lower realms.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ངན་སོང་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་ཐར་བར་བྱེད་དོ། །
en: They will liberate all beings in the lower realms of whichever buddhafields they are born into as they engage in the conduct of bodhisattvas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡང་འགྱུར་རོ། །
en: They will never regress in their progress toward unexcelled and perfect buddhahood.

source: མི་གང་སངས་རྒྱས་མཚན་འདི་རྗོད་བྱེད་པ། །དེ་ཡི་ཡོན་ཏན་བགྲང་བར་མི་ནུས་ཤིང་། །དེ་ནི་བྱང་ཆུབ་འཐོབ་པར་ཐེ་ཚོམ་མེད། །
en: “ ‘Those who speak the name of this buddha Will have incalculable qualities And will undoubtedly attain buddhahood.

source: དེ་ལ་ཐེ་ཚོམ་མེད་པར་གཟུངས་སྐྱེའོ། །
en: Without a doubt, dhāraṇīs will arise for them.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཤར་ལྷོའི་མཚམས་ཀྱི་ཕྱོགས་ན་ཤིན་ཏུ་མཛེས་པ་བཀོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན།
en: “Guṇaratnasaṅkusumita, to the southeast of here is a world system known as Very Beautiful Array.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྲུག་སྟོང་བསྒྲགས་པའི་སྒྲ་སྐད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There, the thus-gone, worthy, perfect Buddha King of the Sound of a Thousand Thunderclaps currently resides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཡོན་ཏན་འབྱུང་བ་ཞེས་བྱའོ། །
en: That eon is known as Emergence of Qualities.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྲུག་སྟོང་བསྒྲགས་པའི་སྒྲ་སྐད་ཀྱི་རྒྱལ་པོ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་དེ་ནི་ཚེ་རྗེས་མ་ཐག་ཏུ་མི་འཇིགས་པ་བཞི་འཐོབ་པར་འགྱུར་རོ། །རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་འཐོབ་པར་འགྱུར་རོ། །བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་འཐོབ་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha King of the Sound of a Thousand Thunderclaps will, immediately in their next lives, attain the fourfold fearlessness, the four bases of miraculous powers, and great love, as well as great compassion.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain the eighteen unique qualities of the buddhas.

source: དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain the array of qualities just as they are in the buddhafield of the Thus-Gone One Amitāyus.

source: བུད་མེད་ཀྱི་ཚེ་རྗེས་ནས་སྐྱེས་པའི་ལུས་འཐོབ་པར་འགྱུར་རོ། །
en: Following a female birth, they will be born into the body of a man.

source: གང་ཞིག་རྒྱལ་བའི་མཚན་འདི་འཛིན་བྱེད་པའི། །བྱང་ཆུབ་སེམས་དཔས་ཡོན་ཏན་འདི་དང་གཞན། །བསམ་གྱིས་མི་ཁྱབ་རྟག་ཏུ་འཐོབ་པར་འགྱུར། །
en: “ ‘Any bodhisattvas who remember this victor’s name Will always attain these qualities And inconceivably many others.

source: བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་མང་པོ་མཐོང་། །
en: Those bodhisattvas will behold many buddhas.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ལྷོ་ནུབ་མཚམས་ཀྱི་ཕྱོགས་ན་བཀོད་པ་དཔག་ཏུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན།
en: “Guṇaratnasaṅkusumita, to the southwest of here is a world system known as Immeasurable Array.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་མཆོག་འོད་དཔལ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There, the thus-gone, worthy, perfect Buddha Glorious Supremely Golden Light resides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྐྱེད་པ་ཞེས་བྱའོ། །
en: That eon is known as Creation of All Qualities.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་མཆོག་འོད་དཔལ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་དེ་མཚན་ཐོས་པ་དེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱེ་བ་ཕྲག་དགུ་མཉེས་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha Glorious Supremely Golden Light please ninety million blessed buddhas just by hearing that name.

source: སེམས་ཅན་ཐམས་ཅད་མཆོག་ཏུ་འགྲོ་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain the absorption known as elevating all beings to greatness .

source: རྒྱུ་གང་གིས་ན་སེམས་ཅན་ཐམས་ཅད་མཆོག་ཏུ་འགྲོ་བར་བྱེད་ཅེས་བྱ་ཞེ་ན།
en: Why is it called elevating all beings to greatness ?

source: རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ནས། ཆོས་སྟོན་པར་འགྱུར་ཞིང་།
en: When a noble son or daughter rests in this absorption, subsequently teaches the Dharma,

source: དེ་ཆོས་སྟོན་པ་ན་ཏིང་ངེ་འཛིན་དེའི་ཆོས་ཉིད་ཐོབ་པས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སེམས་ཅན་གང་དག་འཁོད་པ་དེ་དག་ཐམས་ཅད་བདེ་བ་དང་ལྡན་པར་འགྱུར་ཏེ།
en: and attains the nature of that absorption while teaching the Dharma, it brings happiness to all beings within the world systems of a great trichiliocosm.

source: དཔེར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡིད་འོང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ན། སེམས་ཅན་རྣམས་གཅིག་ཏུ་བདེ་བ་དང་ལྡན་ཞིང་། སེམས་ཅན་ངན་སོང་དུ་སྐྱེས་པ་ཐམས་ཅད་ཡོངས་སུ་ཐར་བར་འགྱུར་ཏེ།
en: For example, this is just like how all beings in the buddhafield of the thus-gone, worthy, perfect Buddha Manojña attain happiness together, and how all the beings in the lower realms there are freed,

source: དེ་དག་དེ་ནས་ཡོངས་སུ་གྲོལ་ནས་ལྷ་དང་མིའི་ལུས་ཐོབ་པར་འགྱུར་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བ་བཞིན་ནོ། །
en: and how after being freed from the lower realms they attain the bodies of gods and humans and are certain to attain unexcelled and perfect buddhahood.

source: གསེར་མཆོག་འོད་དཔལ་གྱི་ནི་མཚན་འཛིན་པ། །དེ་ལ་གཟི་བརྗིད་དཔལ་མདོག་སྟོབས་དབང་པོ། །ཚེ་རབས་ཀུན་ཏུ་རྙེད་པར་དཀའ་མ་ཡིན། །
en: “ ‘Those who remember the name Glorious Supremely Golden Light Will, in all lives, have no trouble becoming Mighty lords with glorious and radiant appearances.

source: དེ་ལ་བློ་ཐོགས་མེད་པ་མཐའ་ཡས་འགྱུར། །
en: Their minds will become unobstructed and limitless.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ནུབ་བྱང་མཚམས་ན་སྡིག་པ་དང་བྲལ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་
en: “Guṇaratnasaṅkusumita, to the northwest of here is a world system known as Free of Evil Deeds.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་རྣམ་མང་དཔལ་སྣང་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There, the thus-gone, worthy, perfect Buddha King of Splendor with Many Glorious Appearances resides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཁྱིམ་རྒྱས་པ་ཞེས་བྱའོ། །
en: That eon is known as Flourishing of Householders.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་རྣམ་མང་དཔལ་སྣང་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་དེ་ནི་ཚེ་རྗེས་མ་ཐག་ཏུ་སྤོབས་པ་དཔག་ཏུ་མེད་པ་བཀོད་པ་ཞེས་བྱ་བའི་གཟུངས་འཐོབ་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha King of Splendor with Many Glorious Appearances will, immediately in their next lives, attain the dhāraṇī called array of immeasurable eloquence.

source: ཚེགས་ཆུང་ངུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚེ་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་འཛིན་པར་འགྱུར་རོ། །
en: With little effort, they will come to possess the array of qualities of the buddhafield of the thus-gone, worthy, perfect Buddha Amitāyus.

source: སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུའི་ཆོས་སྟོན་པ་ཡང་ཐོས་པར་འགྱུར། འཛིན་པར་འགྱུར་རོ། །
en: They will hear the discourses of eight hundred million buddhas and remember them.

source: གང་ཞིག་རྒྱལ་བའི་མཚན་མཆོག་འདི་འཛིན་པ། །ཚེ་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཞིང་དུ་དེ། །དེ་ནི་ཚེ་དཔག་མེད་ལྡན་ཆོས་ཤེས་འགྱུར། །
en: “ ‘Those who remember the glorious name of this victor Will gain boundless life and understanding of the Dharma In the buddhafield of Amitāyus.

source: སྐྱེ་གཅིག་ཐོགས་པས་བྱང་ཆུབ་རྫོགས་འཚང་རྒྱ། །
en: With just a single rebirth remaining, they will awaken to perfect buddhahood.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་བྱང་ཤར་མཚམས་ཀྱི་ཕྱོགས་ན་
en: “Guṇaratnasaṅkusumita, to the northeast of here is a world system known as Transcending All Misery.

source: མྱ་ངན་ཐམས་ཅད་ལས་རྒལ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་པར་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་པ་ཞེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There, the thus-gone, worthy, perfect Buddha He Who Attained Awakening after Countless Millions of Eons resides, alive and well.

source: བསྐལ་པ་དེ་ནི་སྤོབས་པ་བཀོད་པ་ཞེས་བྱའོ། །
en: That eon is known as Array of Eloquence.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་པར་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་པ་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་དེ་ནི་ཚེ་རྗེས་མ་ཐག་ཏུ་རྣམ་པ་དྲུག་ཅུ་དང་ལྡན་པའི་སྒྲ་དབྱངས་ཀྱི་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha He Who Attained Awakening after Countless Millions of Eons will, immediately in their next lives, attain the excellent eloquence of speech endowed with the sixty qualities,

source: སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་འཛིན་པར་འགྱུར་རོ། །
en: and they will attain the development of roots of virtue before eight hundred million buddhas.

source: སྒྲ་དབྱངས་ཡན་ལག་དྲུག་ཅུ་ཕུན་ཚོགས་ལྡན། །དེ་ནི་ཀུན་ཏུ་ཤེས་པ་འང་ཕ་རོལ་ཕྱིན། །
en: “ ‘Endowed with the excellent sixty qualities of speech, As well as an understanding that is perfected,

source: རྒྱལ་བ་བྱེ་བ་བརྒྱད་ཅུ་མཆོད་བྱེད་པའི། །བསོད་ནམས་གང་ཡིན་བསམ་ཡས་དེས་འཐོབ་འགྱུར། །
en: They will attain the inconceivable merit Of worshiping eighty million victors.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་སྟེང་གི་ཕྱོགས་ན་
en: “Guṇaratnasaṅkusumita, above here is a world system known as Splendor Arrayed with Immeasurable Qualities.

source: ཡོན་ཏན་དཔག་ཏུ་མེད་པ་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་བཟང་པོ་དང་། ནམ་མཁའ་ངེས་པར་སྒྲོགས་པ་བཀོད་པའི་འོད་ཅེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེའཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There the thus-gone, worthy, perfect Buddha Array of Light Constantly Proclaiming Pure Gold and Space abides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཚད་མེད་ལེན་ཅེས་བྱའོ། །
en: That eon is known as Attaining the Immeasurable.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་བཟང་པོ་དང་། ནམ་མཁའ་ངེས་པར་སྒྲོགས་པ་བཀོད་པའི་འོད་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha Array of Light Constantly Proclaiming Pure Gold and Space purify an immeasurable aggregate of discipline.

source: ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་རོ། །
en: They also purify an immeasurable aggregate of absorption, an immeasurable aggregate of insight, an immeasurable aggregate of liberation, and an immeasurable aggregate of liberated wisdom vision.
